In [2]:
import pandas as pd
import numpy as np
firm_name={"03":"IBK기업은행", "11":"NH농협은행", "20":"우리카드",
"23":"SC제일은행","48":"새마을금고",	"72":"우체국"}

In [4]:
df = pd.DataFrame.from_dict(firm_name, orient='index', columns = ['FIRM_NAME'])

In [5]:
df

   FIRM_NAME
03   IBK기업은행
11    NH농협은행
20      우리카드
23    SC제일은행
48     새마을금고
72       우체국

In [14]:
df = pd.read_csv('msg_code', names=['MSG_CODE', 'MSG_NAME'], dtype=str)

In [15]:
df.head()

  MSG_CODE     MSG_NAME
0     0100       MS승인요청
1     0110       MS승인응답
2     0300  BC통합IC승인 요청
3     0310  BC통합IC승인 응답
4     0420    MS승인취소 요청

In [16]:
df = df.set_index('MSG_CODE')

In [17]:
df

               MSG_NAME
MSG_CODE
0100             MS승인요청
0110             MS승인응답
0300        BC통합IC승인 요청
0310        BC통합IC승인 응답
0420          MS승인취소 요청
0430          MS승인취소 응답
9300         NONBC승인 요청
9310         NONBC승인 응답
0400      BC통합IC승인취소 요청
0410      BC통합IC승인취소 응답
0200           현금서비스 요청
0210           현금서비스 응답

In [18]:
df = pd.read_csv('msg_code', names=['MSG_CODE', 'MSG_NAME'], dtype=str)

In [19]:
df['COUNT'] = [ np.random.randint(5,10) for i in range(len(df.index)) ]

In [20]:
df

   MSG_CODE       MSG_NAME  COUNT
0      0100         MS승인요청      8
1      0110         MS승인응답      6
2      0300    BC통합IC승인 요청      8
3      0310    BC통합IC승인 응답      6
4      0420      MS승인취소 요청      7
5      0430      MS승인취소 응답      6
6      9300     NONBC승인 요청      9
7      9310     NONBC승인 응답      8
8      0400  BC통합IC승인취소 요청      5
9      0410  BC통합IC승인취소 응답      6
10     0200       현금서비스 요청      5
11     0210       현금서비스 응답      7

In [21]:
df = pd.DataFrame( np.arange(9).reshape(3,3), index=['r1','r2','r3'], columns=['c1','c2','c3'])

In [33]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3,4), index=['1','2','3'] , columns=['a1','a2', 'a3','a4'])

In [34]:
df

   a1  a2  a3  a4
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11

In [38]:
df[df["a1"]>5]

   a1  a2  a3  a4
3   8   9  10  11

In [42]:
df[(df.a1 > 1) & (df.a2 <8)]

   a1  a2  a3  a4
2   4   5   6   7

In [56]:
df = pd.DataFrame(np.arange(12).reshape(3,4), index=['1','2','3'] , columns=['a1','a2', 'a3','a4'])
df[['a3','a2']]

   a3  a2
1   2   1
2   6   5
3  10   9

In [69]:
df = pd.DataFrame(np.array([100,20000, 50,50000, 90, 50000]).reshape(3,2),
columns=['성능','가격'], index=['BC1','BC2','BC3'])

In [70]:
df

      성능     가격
BC1  100  20000
BC2   50  50000
BC3   90  50000

In [71]:
df.loc['BC1']

성능      100
가격    20000
Name: BC1, dtype: int32

In [72]:
df.loc['BC1','가격']

20000

In [73]:
df.loc[(df.성능%50==0),"성능"] # 전체 열에서 성능%50 == 0 조건으로 필터링 중 "성능" 칼럼 조회

BC1    100
BC2     50
Name: 성능, dtype: int32

In [74]:
df.loc[(df.성능%50==0),"성능"] =80 # 선택된 "성능" 칼럼의 데이터들을 70으로 전체 변경

In [75]:
df

     성능     가격
BC1  80  20000
BC2  80  50000
BC3  90  50000

In [76]:
df

     성능     가격
BC1  80  20000
BC2  80  50000
BC3  90  50000

In [78]:
df.sort_values('성능', ascending=False) # '성능' 기준으로 내림차순 정렬

     성능     가격
BC3  90  50000
BC1  80  20000
BC2  80  50000

In [80]:
df.sort_values('성능',ascending=True)  # '성능' 기준으로 오름차순 정렬

     성능     가격
BC1  80  20000
BC2  80  50000
BC3  90  50000

In [81]:
df

     성능     가격
BC1  80  20000
BC2  80  50000
BC3  90  50000

In [82]:
df.sum()

성능       250
가격    120000
dtype: int64

In [83]:
df.sum(axis=1) # 각 로우별 합계

BC1    20080
BC2    50080
BC3    50090
dtype: int64

In [88]:
df['ROW_SUM'] = df.sum(axis=1)  # 신규 칼럼 추가

In [91]:
df.loc['COL_SUM', :] = df.sum() # 신규 로우 추가

In [92]:
df

            성능        가격   ROW_SUM
BC1       80.0   20000.0   40160.0
BC2       80.0   50000.0  100160.0
BC3       90.0   50000.0  100180.0
COL_SUM  750.0  360000.0  721500.0

In [98]:
beg_time = pd.to_datetime('20180907 12:30:05', format='%Y%m%d %H:%M:%S')

In [99]:
beg_time

Timestamp('2018-09-07 12:30:05')

In [100]:
end_time = pd.to_datetime('20180907 12:31:05', format='%Y%m%d %H:%M:%S')  
end_time

Timestamp('2018-09-07 12:31:05')

In [101]:
end_time - beg_time

Timedelta('0 days 00:01:00')

In [102]:
pd.date_range('20180101', '20180901', freq='M') #월말

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31', '2018-06-30', '2018-07-31', '2018-08-31'],
              dtype='datetime64[ns]', freq='M')

In [114]:
df= pd.DataFrame(pd.date_range('20180101', '20181001', freq='M') , columns=['DATE1'])

In [115]:
df

       DATE1
0 2018-01-31
1 2018-02-28
2 2018-03-31
3 2018-04-30
4 2018-05-31
5 2018-06-30
6 2018-07-31
7 2018-08-31
8 2018-09-30

In [116]:
df['DATE2'] = pd.date_range('20180101', '20180901', freq='MS')

In [117]:
df

       DATE1      DATE2
0 2018-01-31 2018-01-01
1 2018-02-28 2018-02-01
2 2018-03-31 2018-03-01
3 2018-04-30 2018-04-01
4 2018-05-31 2018-05-01
5 2018-06-30 2018-06-01
6 2018-07-31 2018-07-01
7 2018-08-31 2018-08-01
8 2018-09-30 2018-09-01

### 현재 시점의 시간으로 부터 앞으로 5분 사이의 10초당 간격 리스트 추출

In [120]:
import datetime
import pandas as pd
beg_time = datetime.datetime.now() #현재시간 datetime 객체
end_time = datetime.datetime.now() + datetime.timedelta(minutes=5) #5분 이후 datetime 객체
print(pd.date_range(beg_time, end_time, freq='10s')) #10초 간격으로 시간 리스트 구함

DatetimeIndex(['2019-06-23 01:47:10.043974', '2019-06-23 01:47:20.043974',
               '2019-06-23 01:47:30.043974', '2019-06-23 01:47:40.043974',
               '2019-06-23 01:47:50.043974', '2019-06-23 01:48:00.043974',
               '2019-06-23 01:48:10.043974', '2019-06-23 01:48:20.043974',
               '2019-06-23 01:48:30.043974', '2019-06-23 01:48:40.043974',
               '2019-06-23 01:48:50.043974', '2019-06-23 01:49:00.043974',
               '2019-06-23 01:49:10.043974', '2019-06-23 01:49:20.043974',
               '2019-06-23 01:49:30.043974', '2019-06-23 01:49:40.043974',
               '2019-06-23 01:49:50.043974', '2019-06-23 01:50:00.043974',
               '2019-06-23 01:50:10.043974', '2019-06-23 01:50:20.043974',
               '2019-06-23 01:50:30.043974', '2019-06-23 01:50:40.043974',
               '2019-06-23 01:50:50.043974', '2019-06-23 01:51:00.043974',
               '2019-06-23 01:51:10.043974', '2019-06-23 01:51:20.043974',
               '2019-06-23 01:51:30.043974', '2019-06-23 01:51:40.043974',
               '2019-06-23 01:51:50.043974', '2019-06-23 01:52:00.043974',
               '2019-06-23 01:52:10.043974'],
              dtype='datetime64[ns]', freq='10S')

### DataFrame Merge
- 2개 DataFrame을 Join 하는 방법 : merge
 - pd.merge( df1, df2, on=['KEY',…], how='inner')
 - on = [ ]에 들어갈 값들은 병합 기준이 되는 칼럼명 (입력하지 않으면 동일 칼럼명들 지정)
 - how = 'inner', 'left', 'right', 'outer' 중 선택 1개 (입력하지 않으면 inner로 지정 처리)

In [122]:
code = {'CODE':['A','B','C','D','E'], 'NAME':['아','비','씨','디','이']}
code2 = {'CODE' :['A','B','C','X','Y'],'VALUE':['1','2','3','4','5']}
tf = pd.DataFrame.from_dict(code)  
vf = pd.DataFrame.from_dict(code2)
pd.merge(tf, vf)

  CODE NAME VALUE
0    A    아     1
1    B    비     2
2    C    씨     3

### Merge - Inner Join
- pd.merge( df1, df2, on=['CODE'], how='inner')
 - 기준 칼럼에서 같은 값을 가진 열들의 요소들을 합친다.
 - 기준 칼럼에서 같은 값이 아닌 대상들은 모두 제외된다.

In [123]:
code1 = {'CODE':['A','B','C','D','E'], 'NAME':['아','비','씨','디','이']}
code2    = {'CODE' :['A','B','C','X','Y'],	'VALUE':['1','2','3','4','5']}

df1 = pd.DataFrame.from_dict(code1) 
df2 = pd.DataFrame.from_dict(code2)

rf = pd.merge(df1, df2, on=['CODE'], how='inner') # how를 지정하지 않아도 기본 inner로 동작

In [124]:
rf

  CODE NAME VALUE
0    A    아     1
1    B    비     2
2    C    씨     3

### Merge - Left Join
- pd.merge( df1, df2, on=['CODE'], how='left')
 - 왼쪽 DataFrame의 다른 열 값들을 보존하며 오른쪽 DataFrame을 끼워 맞춘다.
 - df1.CODE의 전체를 보존하며 병합, df2.CODE에서 없는 것들은 NaN으로 채움

In [128]:
code1 = {'CODE':['A','B','C','D','E'], 'NAME':['아','비','씨','디','이']}
code2   = {'CODE' :['A','B','C','X','Y'],'VALUE':['1','2','3','4','5']}

df1 = pd.DataFrame.from_dict(code1) 
df2 = pd.DataFrame.from_dict(code2)

rf = pd.merge(df1, df2, on=['CODE'], how='left')

In [129]:
rf

  CODE NAME VALUE
0    A    아     1
1    B    비     2
2    C    씨     3
3    D    디   NaN
4    E    이   NaN

### Merge - Right Join
- pd.merge( df1, df2, on=['CODE'], how='right')
 - 오른쪽 DataFrame의 다른 열 값들을 보존하며 왼쪽 DataFrame을 끼워 맞춘다.
 - df2.CODE의 전체를 보존하며 병합, df1.CODE에서 없는 것들은 NaN으로 채움

In [132]:
code1 = {'CODE':['A','B','C','D','E'], 'NAME':['아','비','씨','디','이']}
code2    = {'CODE' :['A','B','C','X','Y'],	'VALUE':['1','2','3','4','5']}

df1 = pd.DataFrame.from_dict(code1)  
df2 = pd.DataFrame.from_dict(code2)
print(df1) , print(df2)
rf = pd.merge(df1, df2, on=['CODE'], how='right')
rf

  CODE NAME
0    A    아
1    B    비
2    C    씨
3    D    디
4    E    이
  CODE VALUE
0    A     1
1    B     2
2    C     3
3    X     4
4    Y     5

  CODE NAME VALUE
0    A    아     1
1    B    비     2
2    C    씨     3
3    X  NaN     4
4    Y  NaN     5

### Merge - Outer Join
- pd.merge( df1, df2, on=['CODE'], how='outer')
 - 두 개의 DataFrame의 기준 칼럼의 합집합 기준으로 병합
 - 서로 없는 CODE 값들에 해당되는 다른 칼럼들은 NaN으로 채움

In [134]:
code1 = {'CODE':['A','B','C','D','E'], 'NAME':['아','비','씨','디','이']}
code2    = {'CODE' :['A','B','C','X','Y'],	'VALUE':['1','2','3','4','5']}

df1 = pd.DataFrame.from_dict(code1)
df2 = pd.DataFrame.from_dict(code2)

rf = pd.merge(df1, df2, on=['CODE'], how='outer')
rf

  CODE NAME VALUE
0    A    아     1
1    B    비     2
2    C    씨     3
3    D    디   NaN
4    E    이   NaN
5    X  NaN     4
6    Y  NaN     5